OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic14/libdev/pic16f18875.c
__at(0x0EC3) __sfr ADCACTPPS;
__at(0x0EC3) volatile __ADCACTPPSbits_t ADCACTPPSbits;

__at(0x0EC5) __sfr SSP1CLKPPS;
__at(0x0EC5) volatile __SSP1CLKPPSbits_t SSP1CLKPPSbits;

__at(0x0EC6) __sfr SSP1DATPPS;
__at(0x0EC6) volatile __SSP1DATPPSbits_t SSP1DATPPSbits;

__at(0x0EC7) __sfr SSP1SSPPS;
__at(0x0EC7) volatile __SSP1SSPPSbits_t SSP1SSPPSbits;

__at(0x0EC8) __sfr SSP2CLKPPS;
__at(0x0EC8) volatile __SSP2CLKPPSbits_t SSP2CLKPPSbits;

__at(0x0EC9) __sfr SSP2DATPPS;
__at(0x0EC9) volatile __SSP2DATPPSbits_t SSP2DATPPSbits;

__at(0x0ECA) __sfr SSP2SSPPS;
__at(0x0ECA) volatile __SSP2SSPPSbits_t SSP2SSPPSbits;

__at(0x0ECB) __sfr RXPPS;
__at(0x0ECB) volatile __RXPPSbits_t RXPPSbits;

__at(0x0ECC) __sfr TXPPS;
__at(0x0ECC) volatile __TXPPSbits_t TXPPSbits;

__at(0x0F10) __sfr RA0PPS;
__at(0x0F10) volatile __RA0PPSbits_t RA0PPSbits;

__at(0x0F11) __sfr RA1PPS;
__at(0x0F11) volatile __RA1PPSbits_t RA1PPSbits;

__at(0x0F12) __sfr RA2PPS;
__at(0x0F12) volatile __RA2PPSbits_t RA2PPSbits;

__at(0x0F13) __sfr RA3PPS;
__at(0x0F13) volatile __RA3PPSbits_t RA3PPSbits;

__at(0x0F14) __sfr RA4PPS;
__at(0x0F14) volatile __RA4PPSbits_t RA4PPSbits;

__at(0x0F15) __sfr RA5PPS;
__at(0x0F15) volatile __RA5PPSbits_t RA5PPSbits;

__at(0x0F16) __sfr RA6PPS;
__at(0x0F16) volatile __RA6PPSbits_t RA6PPSbits;

__at(0x0F17) __sfr RA7PPS;
__at(0x0F17) volatile __RA7PPSbits_t RA7PPSbits;

__at(0x0F18) __sfr RB0PPS;
__at(0x0F18) volatile __RB0PPSbits_t RB0PPSbits;

__at(0x0F19) __sfr RB1PPS;
__at(0x0F19) volatile __RB1PPSbits_t RB1PPSbits;

__at(0x0F1A) __sfr RB2PPS;
__at(0x0F1A) volatile __RB2PPSbits_t RB2PPSbits;

__at(0x0F1B) __sfr RB3PPS;
__at(0x0F1B) volatile __RB3PPSbits_t RB3PPSbits;

__at(0x0F1C) __sfr RB4PPS;
__at(0x0F1C) volatile __RB4PPSbits_t RB4PPSbits;

__at(0x0F1D) __sfr RB5PPS;
__at(0x0F1D) volatile __RB5PPSbits_t RB5PPSbits;

__at(0x0F1E) __sfr RB6PPS;
__at(0x0F1E) volatile __RB6PPSbits_t RB6PPSbits;

__at(0x0F1F) __sfr RB7PPS;
__at(0x0F1F) volatile __RB7PPSbits_t RB7PPSbits;

__at(0x0F20) __sfr RC0PPS;
__at(0x0F20) volatile __RC0PPSbits_t RC0PPSbits;

__at(0x0F21) __sfr RC1PPS;
__at(0x0F21) volatile __RC1PPSbits_t RC1PPSbits;

__at(0x0F22) __sfr RC2PPS;
__at(0x0F22) volatile __RC2PPSbits_t RC2PPSbits;

__at(0x0F23) __sfr RC3PPS;
__at(0x0F23) volatile __RC3PPSbits_t RC3PPSbits;

__at(0x0F24) __sfr RC4PPS;
__at(0x0F24) volatile __RC4PPSbits_t RC4PPSbits;

__at(0x0F25) __sfr RC5PPS;
__at(0x0F25) volatile __RC5PPSbits_t RC5PPSbits;

__at(0x0F26) __sfr RC6PPS;
__at(0x0F26) volatile __RC6PPSbits_t RC6PPSbits;

__at(0x0F27) __sfr RC7PPS;
__at(0x0F27) volatile __RC7PPSbits_t RC7PPSbits;

__at(0x0F28) __sfr RD0PPS;
__at(0x0F28) volatile __RD0PPSbits_t RD0PPSbits;

__at(0x0F29) __sfr RD1PPS;
__at(0x0F29) volatile __RD1PPSbits_t RD1PPSbits;

__at(0x0F2A) __sfr RD2PPS;
__at(0x0F2A) volatile __RD2PPSbits_t RD2PPSbits;

__at(0x0F2B) __sfr RD3PPS;
__at(0x0F2B) volatile __RD3PPSbits_t RD3PPSbits;

__at(0x0F2C) __sfr RD4PPS;
__at(0x0F2C) volatile __RD4PPSbits_t RD4PPSbits;

__at(0x0F2D) __sfr RD5PPS;
__at(0x0F2D) volatile __RD5PPSbits_t RD5PPSbits;

__at(0x0F2E) __sfr RD6PPS;
__at(0x0F2E) volatile __RD6PPSbits_t RD6PPSbits;

__at(0x0F2F) __sfr RD7PPS;
__at(0x0F2F) volatile __RD7PPSbits_t RD7PPSbits;

__at(0x0F30) __sfr RE0PPS;
__at(0x0F30) volatile __RE0PPSbits_t RE0PPSbits;

__at(0x0F31) __sfr RE1PPS;
__at(0x0F31) volatile __RE1PPSbits_t RE1PPSbits;

__at(0x0F32) __sfr RE2PPS;
__at(0x0F32) volatile __RE2PPSbits_t RE2PPSbits;

__at(0x0F38) __sfr ANSELA;
__at(0x0F38) volatile __ANSELAbits_t ANSELAbits;

__at(0x0F39) __sfr WPUA;
__at(0x0F39) volatile __WPUAbits_t WPUAbits;

__at(0x0F3A) __sfr ODCONA;
__at(0x0F3A) volatile __ODCONAbits_t ODCONAbits;

__at(0x0F3B) __sfr SLRCONA;
__at(0x0F3B) volatile __SLRCONAbits_t SLRCONAbits;

__at(0x0F3C) __sfr INLVLA;
__at(0x0F3C) volatile __INLVLAbits_t INLVLAbits;

__at(0x0F3D) __sfr IOCAP;
__at(0x0F3D) volatile __IOCAPbits_t IOCAPbits;

__at(0x0F3E) __sfr IOCAN;
__at(0x0F3E) volatile __IOCANbits_t IOCANbits;

__at(0x0F3F) __sfr IOCAF;
__at(0x0F3F) volatile __IOCAFbits_t IOCAFbits;

__at(0x0F40) __sfr CCDNA;
__at(0x0F40) volatile __CCDNAbits_t CCDNAbits;

__at(0x0F41) __sfr CCDPA;
__at(0x0F41) volatile __CCDPAbits_t CCDPAbits;

__at(0x0F43) __sfr ANSELB;
__at(0x0F43) volatile __ANSELBbits_t ANSELBbits;

__at(0x0F44) __sfr WPUB;
__at(0x0F44) volatile __WPUBbits_t WPUBbits;

__at(0x0F45) __sfr ODCONB;
__at(0x0F45) volatile __ODCONBbits_t ODCONBbits;

__at(0x0F46) __sfr SLRCONB;
__at(0x0F46) volatile __SLRCONBbits_t SLRCONBbits;

__at(0x0F47) __sfr INLVLB;
__at(0x0F47) volatile __INLVLBbits_t INLVLBbits;

__at(0x0F48) __sfr IOCBP;
__at(0x0F48) volatile __IOCBPbits_t IOCBPbits;

__at(0x0F49) __sfr IOCBN;
__at(0x0F49) volatile __IOCBNbits_t IOCBNbits;

__at(0x0F4A) __sfr IOCBF;
__at(0x0F4A) volatile __IOCBFbits_t IOCBFbits;

__at(0x0F4B) __sfr CCDNB;
__at(0x0F4B) volatile __CCDNBbits_t CCDNBbits;

__at(0x0F4C) __sfr CCDPB;
__at(0x0F4C) volatile __CCDPBbits_t CCDPBbits;

__at(0x0F4E) __sfr ANSELC;
__at(0x0F4E) volatile __ANSELCbits_t ANSELCbits;

__at(0x0F4F) __sfr WPUC;
__at(0x0F4F) volatile __WPUCbits_t WPUCbits;

__at(0x0F50) __sfr ODCONC;
__at(0x0F50) volatile __ODCONCbits_t ODCONCbits;

__at(0x0F51) __sfr SLRCONC;
__at(0x0F51) volatile __SLRCONCbits_t SLRCONCbits;

__at(0x0F52) __sfr INLVLC;
__at(0x0F52) volatile __INLVLCbits_t INLVLCbits;

__at(0x0F53) __sfr IOCCP;
__at(0x0F53) volatile __IOCCPbits_t IOCCPbits;

__at(0x0F54) __sfr IOCCN;
__at(0x0F54) volatile __IOCCNbits_t IOCCNbits;

__at(0x0F55) __sfr IOCCF;
__at(0x0F55) volatile __IOCCFbits_t IOCCFbits;

__at(0x0F56) __sfr CCDNC;
__at(0x0F56) volatile __CCDNCbits_t CCDNCbits;

__at(0x0F57) __sfr CCDPC;
__at(0x0F57) volatile __CCDPCbits_t CCDPCbits;

__at(0x0F59) __sfr ANSELD;
__at(0x0F59) volatile __ANSELDbits_t ANSELDbits;

__at(0x0F5A) __sfr WPUD;
__at(0x0F5A) volatile __WPUDbits_t WPUDbits;

__at(0x0F5B) __sfr ODCOND;
__at(0x0F5B) volatile __ODCONDbits_t ODCONDbits;

__at(0x0F5C) __sfr SLRCOND;
__at(0x0F5C) volatile __SLRCONDbits_t SLRCONDbits;

__at(0x0F5D) __sfr INLVLD;
__at(0x0F5D) volatile __INLVLDbits_t INLVLDbits;

__at(0x0F61) __sfr CCDND;
__at(0x0F61) volatile __CCDNDbits_t CCDNDbits;

__at(0x0F62) __sfr CCDPD;
__at(0x0F62) volatile __CCDPDbits_t CCDPDbits;

__at(0x0F64) __sfr ANSELE;
__at(0x0F64) volatile __ANSELEbits_t ANSELEbits;

__at(0x0F65) __sfr WPUE;
__at(0x0F65) volatile __WPUEbits_t WPUEbits;

__at(0x0F66) __sfr ODCONE;
__at(0x0F66) volatile __ODCONEbits_t ODCONEbits;

__at(0x0F67) __sfr SLRCONE;
__at(0x0F67) volatile __SLRCONEbits_t SLRCONEbits;

__at(0x0F68) __sfr INLVLE;
__at(0x0F68) volatile __INLVLEbits_t INLVLEbits;

__at(0x0F69) __sfr IOCEP;
__at(0x0F69) volatile __IOCEPbits_t IOCEPbits;

__at(0x0F6A) __sfr IOCEN;
__at(0x0F6A) volatile __IOCENbits_t IOCENbits;

__at(0x0F6B) __sfr IOCEF;
__at(0x0F6B) volatile __IOCEFbits_t IOCEFbits;

__at(0x0F6C) __sfr CCDNE;
__at(0x0F6C) volatile __CCDNEbits_t CCDNEbits;

__at(0x0F6D) __sfr CCDPE;
__at(0x0F6D) volatile __CCDPEbits_t CCDPEbits;

__at(0x0FE4) __sfr STATUS_SHAD;
__at(0x0FE4) volatile __STATUS_SHADbits_t STATUS_SHADbits;

__at(0x0FE5) __sfr WREG_SHAD;

__at(0x0FE6) __sfr BSR_SHAD;

__at(0x0FE7) __sfr PCLATH_SHAD;

__at(0x0FE8) __sfr FSR0L_SHAD;

__at(0x0FE9) __sfr FSR0H_SHAD;

__at(0x0FEA) __sfr FSR1L_SHAD;

__at(0x0FEB) __sfr FSR1H_SHAD;

__at(0x0FED) __sfr STKPTR;

__at(0x0FEE) __sfr TOSL;

__at(0x0FEF) __sfr TOSH;
